In [1]:
import numpy as np
import pandas as pd

# `pivot table`
    
    The pivot table is a special kind of table.

In [2]:
import seaborn as sns

In [3]:
tips = sns.load_dataset('tips')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

#### `Example 1`

    In this example we are using the sex column as the index of our pivot table which means that all the categories
    inside the sex columns will be made as rows. 
    Similarily, we are providing smoker column as the column of our pivot table. 
    
    This means that categories inside the smoker column of the dataframe will be made as columns of the pivot table.
    
    values = 'total_bill'
    
    This will make the entries of the pivot table as mean of the total_bill. By default if we do not provide an aggregate
    function, mean() is taken.
    
    We can however specify the aggfunc to be used.

In [4]:
tips.pivot_table(index = 'sex', columns = 'smoker', values = 'total_bill', aggfunc = 'sum')

smoker      Yes       No
sex
Male    1337.07  1919.75
Female   593.27   977.68

In [5]:
tips.pivot_table(index = 'day', columns = 'sex', values = 'tip')

sex       Male    Female
day
Thur  2.980333  2.575625
Fri   2.693000  2.781111
Sat   3.083898  2.801786
Sun   3.220345  3.367222

In [6]:
tips.groupby(['day', 'sex'])['tip'].mean()

C:\Users\HU496FA\AppData\Local\Temp\ipykernel_26132\4172537417.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  tips.groupby(['day', 'sex'])['tip'].mean()

day   sex
Thur  Male      2.980333
      Female    2.575625
Fri   Male      2.693000
      Female    2.781111
Sat   Male      3.083898
      Female    2.801786
Sun   Male      3.220345
      Female    3.367222
Name: tip, dtype: float64

#### `You can compare the above two cells. Pivot tables are not a new concept. They are just a syntactical sugar.`

### `Example 2`

In [7]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [8]:
tips.pivot_table(
                    index = ['sex', 'smoker'], 
                    columns = ['day', 'time'], 
                    values = 'total_bill', 
                    aggfunc = {'total_bill':'sum'}
                )

day              Thur           Fri           Sat           Sun
time            Lunch Dinner  Lunch  Dinner Lunch  Dinner Lunch  Dinner
sex    smoker
Male   Yes     191.71   0.00  34.16  129.46   0.0  589.62   0.0  392.12
       No      369.73   0.00   0.00   34.95   0.0  637.73   0.0  877.34
Female Yes     134.53   0.00  39.78   48.80   0.0  304.00   0.0   66.16
       No      381.58  18.78  15.98   22.75   0.0  247.05   0.0  291.54